/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Не удалось выполнить операцию";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Произошла неизвестная ошибка (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Не удается выполнить действие";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Повторите попытку позже.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Не удается выполнить запись";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Попытайтесь повторить запись.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Не удается выполнить запись";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Остановите все операции, использующие устройство (%@), и повторите попытку."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Не удается выполнить запись";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Попытайтесь повторить запись.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Запись остановлена";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Попытайтесь повторить запись.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Операция остановлена";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Недостаточно места для записи файла. Освободите место, удалив имеющиеся видео или фотографии.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Запись остановлена";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Попытайтесь повторить запись.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Запись остановлена";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Попытайтесь повторить запись.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Запись остановлена";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Достигнута максимальная длительность для этой записи."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Запись остановлена";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Достигнут максимальный размер для этой записи."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Запись остановлена";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Остановите все операции, использующие устройство записи, и повторите попытку.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Запись остановлена";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Достигнута максимальная длительность для этой записи."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Не удается выполнить запись";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Попытайтесь повторить запись.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Невозможно использовать устройство (%@)"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Остановите все операции, использующие устройство (%@), и повторите попытку."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Невозможно использовать устройство (%@)"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Остановите все операции, использующие устройство (%@), и повторите попытку."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Запись остановлена";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Остановите все операции, использующие устройство записи, и повторите попытку.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Не удается выполнить действие";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Повторите попытку позже.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Не удается выполнить экспорт";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Попытайтесь повторить экспорт.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Не удается декодировать";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Не удалось декодировать медиафайл. Возможно, он поврежден.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Формат медиафайла не поддерживается.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Не удается сохранить";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Попытайтесь повторить сохранение.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Использование этого медиафайла невозможно.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Использование этого медиафайла невозможно.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Использование этого медиафайла невозможно.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Использование этого медиафайла невозможно.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Формат медиафайла не поддерживается.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Возможно, медиафайл поврежден.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Не удается сделать снимок";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Попытайтесь сделать снимок еще раз.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Операция остановлена";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Эта операция не поддерживается для защищенного контента."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Этот контент не авторизован."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Эта программа не авторизована для воспроизведения данного файла."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Использование этого медиафайла невозможно.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Не удается декодировать";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Не удается найти декодер, необходимый для данного медиафайла.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Не удается закодировать";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Не удается найти кодер, необходимый для данного медиафайла.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Не удается декодировать";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Необходимый для данного медиафайла декодер занят.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Остановите все операции, декодирующие медиафайлы, и повторите попытку.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Не удается закодировать";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Необходимый для данного медиафайла кодер занят.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Остановите все операции, кодирующие медиафайлы, и повторите попытку.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Невозможно использовать устройство (%@)"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "Программа, работающая в фоновом режиме, не может использовать устройство «%@»."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Операция остановлена";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Данная операция не поддерживается для этого медиафайла.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Операция остановлена";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Видео невозможно составить в соответствии с предоставленными инструкциями.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Не удается открыть";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Использование этого медиафайла невозможно.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Операция остановлена";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Файл кэш по месту назначения URL использовать нельзя.";
